Cтруктура хранения информации в реляционной базе данных Postgres. 

Cущности структуры:
База данных postgres -> таблицы данных -> поля данных -> строки с данными

1 таблица accounts хранит сводную информацию о лицевых счетах.

поля таблицы: 

id - уникальный номер лицевого счета. Поле, по которому таблица accounts связывается с таблицей meters_info. Первичный ключ;
status - открыт/закрыт;
address - адрес регистрации лицевого счета;
balance - сальдо лицевого счета.

2 таблица meters_info хранит информацию о каждом отдельном счетчике.

поля таблицы: 

id - уникальный идентификатор счетчика. Поле, по которому таблица meters_info связывается с таблицей meters_lifetime. Первичный ключ;
type - тип счетчика: водный, газовый и т. д.;
rate - тип тарифа счетчика: многотарифный, однотарифный и т. д.;
status - введен в эксплуатацию/выведен из эксплуатации;
account_id - номер лицевого счета, за которым закреплен счетчик;


3 таблица meters_lifetime хранит информацию о жизненном цикле счетчика. 

поля таблицы: 

meter_id - уникальный идентификатор счетчика. поле, по которому таблица meters_lifetime связывается с таблицей meters_info. первичный ключ;
installation_date - дата монтажа;
commissioning_date - дата ввода в эксплуатацию;
last_checking_date - дата последней проверки;
decommissioning_date дата вывода из эксплуатации;
deinstallation_date - дата демонтажа;


4 таблица readings хранит информацию о показаниях. 

id - уникальный идентификатор операции. Первичный ключ;
account_id - номер лицевого счета, за которым закреплен счетчик;
meter_id - уникальный идентификатор счетчика;
readings - показания счетчика;
